RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6200/ip/hpm_sysctl_regs.h
/* RETENTION register group index macro definition */
#define SYSCTL_RETENTION_CPU0 (0UL)
#define SYSCTL_RETENTION_CPU1 (1UL)

/* POWER register group index macro definition */
#define SYSCTL_POWER_CPU0 (0UL)
#define SYSCTL_POWER_CPU1 (1UL)

/* RESET register group index macro definition */
#define SYSCTL_RESET_SOC (0UL)
#define SYSCTL_RESET_CPU0 (1UL)
#define SYSCTL_RESET_CPU1 (2UL)

/* CLOCK_CPU register group index macro definition */
#define SYSCTL_CLOCK_CPU_CLK_TOP_CPU0 (0UL)

/* CLOCK register group index macro definition */
#define SYSCTL_CLOCK_CLK_TOP_MCT0 (0UL)
#define SYSCTL_CLOCK_CLK_TOP_MCT1 (1UL)
#define SYSCTL_CLOCK_CLK_TOP_XPI0 (2UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR0 (3UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR1 (4UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR2 (5UL)
#define SYSCTL_CLOCK_CLK_TOP_TMR3 (6UL)
#define SYSCTL_CLOCK_CLK_TOP_URT0 (7UL)
#define SYSCTL_CLOCK_CLK_TOP_URT1 (8UL)
#define SYSCTL_CLOCK_CLK_TOP_URT2 (9UL)
#define SYSCTL_CLOCK_CLK_TOP_URT3 (10UL)
#define SYSCTL_CLOCK_CLK_TOP_URT4 (11UL)
#define SYSCTL_CLOCK_CLK_TOP_URT5 (12UL)
#define SYSCTL_CLOCK_CLK_TOP_URT6 (13UL)
#define SYSCTL_CLOCK_CLK_TOP_URT7 (14UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C0 (15UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C1 (16UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C2 (17UL)
#define SYSCTL_CLOCK_CLK_TOP_I2C3 (18UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI0 (19UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI1 (20UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI2 (21UL)
#define SYSCTL_CLOCK_CLK_TOP_SPI3 (22UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN0 (23UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN1 (24UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN2 (25UL)
#define SYSCTL_CLOCK_CLK_TOP_CAN3 (26UL)
#define SYSCTL_CLOCK_CLK_TOP_PTPC (27UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA0 (28UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA1 (29UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA2 (30UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA3 (31UL)
#define SYSCTL_CLOCK_CLK_TOP_ANA4 (32UL)
#define SYSCTL_CLOCK_CLK_TOP_REF0 (33UL)
#define SYSCTL_CLOCK_CLK_TOP_REF1 (34UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN0 (35UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN1 (36UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN2 (37UL)
#define SYSCTL_CLOCK_CLK_TOP_LIN3 (38UL)

/* ADCCLK register group index macro definition */
#define SYSCTL_ADCCLK_CLK_TOP_ADC0 (0UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC1 (1UL)
#define SYSCTL_ADCCLK_CLK_TOP_ADC2 (2UL)

/* DACCLK register group index macro definition */
#define SYSCTL_DACCLK_CLK_TOP_DAC0 (0UL)
#define SYSCTL_DACCLK_CLK_TOP_DAC1 (1UL)

/* MONITOR register group index macro definition */
#define SYSCTL_MONITOR_SLICE0 (0UL)
#define SYSCTL_MONITOR_SLICE1 (1UL)
#define SYSCTL_MONITOR_SLICE2 (2UL)
#define SYSCTL_MONITOR_SLICE3 (3UL)

/* GPR register group index macro definition */
#define SYSCTL_CPU_GPR_GPR0 (0UL)
#define SYSCTL_CPU_GPR_GPR1 (1UL)
#define SYSCTL_CPU_GPR_GPR2 (2UL)
#define SYSCTL_CPU_GPR_GPR3 (3UL)
#define SYSCTL_CPU_GPR_GPR4 (4UL)
#define SYSCTL_CPU_GPR_GPR5 (5UL)
#define SYSCTL_CPU_GPR_GPR6 (6UL)
#define SYSCTL_CPU_GPR_GPR7 (7UL)
#define SYSCTL_CPU_GPR_GPR8 (8UL)
#define SYSCTL_CPU_GPR_GPR9 (9UL)
#define SYSCTL_CPU_GPR_GPR10 (10UL)
#define SYSCTL_CPU_GPR_GPR11 (11UL)
#define SYSCTL_CPU_GPR_GPR12 (12UL)
#define SYSCTL_CPU_GPR_GPR13 (13UL)

/* WAKEUP_STATUS register group index macro definition */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS0 (0UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS1 (1UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS2 (2UL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS3 (3UL)

/* WAKEUP_ENABLE register group index macro definition */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE0 (0UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE1 (1UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE2 (2UL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE3 (3UL)

/* CPU register group index macro definition */
#define SYSCTL_CPU_CPU0 (0UL)
#define SYSCTL_CPU_CPU1 (1UL)


#endif /* HPM_SYSCTL_H */
